In [1]:
#pip install mysql-connector-python
import mysql.connector

In [10]:
## This is a connection for mysql server

db = mysql.connector.connect(

    host ='localhost',
    user = 'root',
    password = 'admin'
)
print(db)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000002B6DE6102B0>

In [13]:
mycursor = db.cursor()
print(mycursor)

CMySQLCursor: (Nothing executed yet)

In [5]:
mycursor.execute("CREATE DATABASE pregradstudents")

In [7]:
mycursor.execute("SHOW DATABASES")

for i in mycursor:
    print(i)

('information_schema',)
('mysql',)
('performance_schema',)
('pregrad',)
('pregradstudents',)
('sakila',)
('sys',)
('world',)

In [8]:
mycursor.close()

True

In [12]:
mycursor.execute("SHOW DATABASES")

for i in mycursor:
    print(i)

('information_schema',)
('mysql',)
('performance_schema',)
('pregrad',)
('pregradstudents',)
('sakila',)
('sys',)
('world',)

In [15]:
db = mysql.connector.connect(

    host ='localhost',
    user = 'root',
    password = 'admin',
    database = 'pregradstudents'


)
print(db)
mycursor = db.cursor()
print(mycursor)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000002B6DE5E1D20>
CMySQLCursor: (Nothing executed yet)

In [16]:
mycursor.execute('CREATE TABLE Student_details (Name varchar(50), Address varchar(100))')

In [18]:
mycursor.execute("SHOW TABLES")
for i in mycursor:
    print(i)

('student_details',)

In [20]:
mycursor.execute('ALTER TABLE student_details ADD id INT AUTO_INCREMENT PRIMARY KEY')

In [24]:
query = "INSERT INTO student_details (Name,Address) VALUE (%s,%s)"
val = ("alok", "allahabad")
mycursor.execute(query,val)
db.commit()
print(mycursor.rowcount,"record inserted")

1 record inserted

In [25]:
query = "INSERT INTO student_details (Name,Address) VALUE (%s,%s)"
val = ("alok ranjan", "Prayagraj")
mycursor.execute(query,val)
db.commit()
print(mycursor.rowcount,"record inserted")
mycursor.close()
mycursor = db.cursor()
mycursor.execute("select * from student_details order by desc")
myresult = mycursor.fetchall()
for i in myresult:
    print(i)

1 record inserted
('alok', 'allahabad', 1)
('alok ranjan', 'Prayagraj', 2)

In [30]:
mycursor = db.cursor()
mycursor.execute("select * from student_details order by name desc limit 1")
myresult = mycursor.fetchone()
myresult

('alok ranjan', 'Prayagraj', 2)

In [28]:
myresult

[('alok ranjan', 'Prayagraj', 2)]

In [31]:
query = "INSERT INTO student_details (Name,Address) VALUE (%s,%s)"
val = ("Pratham sharma", "Pregrad student august batch")
mycursor.execute(query,val)
db.commit()
print(mycursor.rowcount,"record inserted")
mycursor.close()

############### Retrieved recent instred data #################

mycursor = db.cursor()
mycursor.execute("select * from student_details order by name desc limit 1")
myresult = mycursor.fetchone()
myresult

1 record inserted

('Pratham sharma', 'Pregrad student august batch', 3)

In [33]:
query = "INSERT INTO student_details (Name,Address) VALUE (%s,%s)"
val = [
  ('Peter', 'Lowstreet 4'),
  ('Amy', 'Apple st 652'),
  ('Hannah', 'Mountain 21'),
  ('Michael', 'Valley 345'),
  ('Sandy', 'Ocean blvd 2'),
  ('Betty', 'Green Grass 1'),
  ('Richard', 'Sky st 331'),
  ('Susan', 'One way 98'),
  ('Vicky', 'Yellow Garden 2'),
  ('Ben', 'Park Lane 38'),
  ('William', 'Central st 954'),
  ('Chuck', 'Main Road 989'),
  ('Viola', 'Sideway 1633')
]
mycursor.executemany(query,val)
db.commit()
print(mycursor.rowcount,"record inserted")

13 record inserted

In [34]:
mycursor = db.cursor()
mycursor.execute("select * from student_details")
myresult = mycursor.fetchall()
myresult

[('alok', 'allahabad', 1),
 ('alok ranjan', 'Prayagraj', 2),
 ('Pratham sharma', 'Pregrad student august batch', 3),
 ('Peter', 'Lowstreet 4', 4),
 ('Amy', 'Apple st 652', 5),
 ('Hannah', 'Mountain 21', 6),
 ('Michael', 'Valley 345', 7),
 ('Sandy', 'Ocean blvd 2', 8),
 ('Betty', 'Green Grass 1', 9),
 ('Richard', 'Sky st 331', 10),
 ('Susan', 'One way 98', 11),
 ('Vicky', 'Yellow Garden 2', 12),
 ('Ben', 'Park Lane 38', 13),
 ('William', 'Central st 954', 14),
 ('Chuck', 'Main Road 989', 15),
 ('Viola', 'Sideway 1633', 16)]

In [35]:
import pandas as pd

In [37]:
import sqlalchemy
sqlalchemy.__version__

'2.0.32'

In [38]:
from sqlalchemy import create_engine
engine = create_engine('mysql+mysqlconnector://root:admin@localhost:3306/pregradstudents')

In [39]:
df = pd.read_sql_table('student_details',engine)

In [40]:
df

              Name                       Address  id
0             alok                     allahabad   1
1      alok ranjan                     Prayagraj   2
2   Pratham sharma  Pregrad student august batch   3
3            Peter                   Lowstreet 4   4
4              Amy                  Apple st 652   5
5           Hannah                   Mountain 21   6
6          Michael                    Valley 345   7
7            Sandy                  Ocean blvd 2   8
8            Betty                 Green Grass 1   9
9          Richard                    Sky st 331  10
10           Susan                    One way 98  11
11           Vicky               Yellow Garden 2  12
12             Ben                  Park Lane 38  13
13         William                Central st 954  14
14           Chuck                 Main Road 989  15
15           Viola                  Sideway 1633  16